Autodesk.Revit.DB.NumberingSchema.ValidateSteelScopeCategory(Autodesk.Revit.DB.ElementId)
Tests whether the input category is valid for numbering.
category:
The category to test.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.SetScopeDefiningCategoriesAndOutputParam(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId)
Set the categories that define the scope of this numbering schema.
Categories that define the scope of the template
The output parameter for the numbering
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given numberingParameterId is not compatible with the categories provided in scopeCategories for this numbering schema.
-or-
The steel categories are not valid for numbering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetScopeDefiningCategories
Get the categories that define the scope of this numbering schema.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.SetScopeDefiningCategories(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Set the categories that define the scope of this numbering schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given scopeCategories are not valid for this numbering schema.
-or-
The steel categories are not valid for numbering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.SteelTaskExecutedHandler(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Handles the steel task executed event.
aDoc:
The document where the event occurred.
elementIds:
The ids of the elements that were affected by the steel task.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.ElementId,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},System.Int32)
Creates a numbering schema and registers it with a document.
aDoc:
The target docment where this schema will be created.
schemaName:
Name of the schema.
numberingParameterId:
The id of the parameter that represents the number of the numbered element.
scopeCategories:
The categories of the elements that will be numbered by this schema.
priority:
The priority of the schema
Returns:
Return schema which has not been added to a document or
registered with a numbering tracker. If schema was not created,
an exception is raised.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given schemaName has is invalid or allready in use.
-or-
The input schemaName already exists in the target document.
-or-
The given numberingParameterId is not compatible with the categories provided in scopeCategories for this numbering schema.
-or-
The steel categories are not valid for numbering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.SetFormatting(Autodesk.Revit.DB.NumberingFormatSettings)
Set configuration for formatting.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input formattingSettings in not valid for this numbering schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetFormatting
Get configuration for formatting
Since:
2015

Autodesk.Revit.DB.NumberingSchema.ChangePartitioningValue(System.String,System.String)
Moves all elements of a numbering sequence from one partition to another.
fromPartition:
Name of the partition that determines which numbering sequence to move.
The sequence must exist already, otherwise an exception will be thrown.
newPartition:
Name of a partition into which the source sequence is going to be moved.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sequence fromPartition does not exist in the schema.
-or-
the given newPartition cannot be used as a valid name of a numbering partition
because it contains characters that are considered invalid, such as
non-printable characters or those that cannot be used in a file's name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
-or-
The value for the partition can only be changed if it is determined by one non-readonly Text parameter.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.CanChangePartitioningValue
Returns true if this schema has partitions based on one parameter, that parameter is of type Text and it is modifiable.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetNumberingSequencesInfos
Returns all numbering sequences infos within this numbering schema.
Returns:
collection of sequence infos
Since:
2015

Autodesk.Revit.DB.NumberingSchema.RemovePartitioningParameter(Autodesk.Revit.DB.NumberingParameter)
Remove a parameter that is used for partitioning elements in this schema.
Remarks:
This method makes sure that the document will be consistent when it comes to numbering before it exits.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input parameter is not valid for use in partitioning for numbering.
-or-
The schema does not have partitioning parameters
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.AddPartitioningParameter(Autodesk.Revit.DB.NumberingParameter)
Add a parameter to be used for partitioning elements in this schema.
Remarks:
This method makes sure that the document will be consistent when it comes to numbering before it exits.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input parameter is not valid for use in partitioning for numbering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.SetPartitioningParameters(System.Collections.Generic.ISet{Autodesk.Revit.DB.NumberingParameter})
Sets the parameters used for partitioning elements in this schema.
Remarks:
This method makes sure that the document will be consistent when it comes to numbering before it exits.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input parameters are not valid for use in partitioning for numbering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetPartitioningParameters
Returns the parameters used for partitioning elements in this schema.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetUseBuiltInMatchingForCategories
Get the categories that utilize specialized matching.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.SetUseBuiltInMatchingForCategories(System.Collections.Generic.IDictionary{Autodesk.Revit.DB.ElementId,System.Boolean})
Set the categories that utilize specialized matching.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.RemoveMatchingParameter(Autodesk.Revit.DB.NumberingParameter)
Remove a parameter to the matching criteria for this numbering schema.
Remarks:
This method makes sure that the document will be consistent when it comes to numbering before it exits.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input parameter is not valid for use in matching for numbering.
-or-
The schema does not have matching parameters
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.AddMatchingParameter(Autodesk.Revit.DB.NumberingParameter)
Add a new parameter to the matching criteria for this numbering schema.
Remarks:
This method makes sure that the document will be consistent when it comes to numbering before it exits.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input parameter is not valid for use in matching for numbering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.SetMatchingParameters(System.Collections.Generic.ISet{Autodesk.Revit.DB.NumberingParameter})
Sets the parameters used for matching elements in this schema.
Remarks:
This method makes sure that the document will be consistent when it comes to numbering before it exits.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input parameters are not valid for use in matching for numbering.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetMatchingParameters
Returns the parameters used for matching elements in this schema.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetNumberingSchema(Autodesk.Revit.DB.Document,System.String)
Returns an instance of the specified Numbering Schema in the given document.
document:
A document to get the numbering schema from.
schemaName:
The name of a schema to get.
Returns:
Instance of the specified schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given schemaName has is invalid or allready in use.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetNumberingInfoForReferences(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Get all the ElementInfos from a given document related to a set of references.
references:
References that represent the target elements.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Can't access the number while an async operation is running.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetNumberOfPartitions
Get the number of partitions managed by the schema.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetValidCategoriesForNumbering(Autodesk.Revit.DB.Document)
Gets a list of categories that can be used for a numbering.
document:
The document where the elements will be numbered.
Returns:
The IDs of all valid categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.GetAvailableParameters(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Document)
Get all the available parameters that can be used with numbering.
category:
The category for the element that will be numbered.
document:
The document where the elements will be numbered.
Returns:
The parameters that can be used for numbering in this category and from their associations.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.NumberingSchema.ChangeNumber(System.String,System.Int32,System.Int32)
Replaces an existing number with a new one (that does not exist yet).
Remarks:
This method gives the caller the ability to overwrite any number used in a given
numbering sequence as long as the new number does not exist in the same sequence yet.
If an attempt is made to replace a number by another that already exists, an exception
will be thrown.
The new number will automatically be applied to all elements that bear the original
number, thus those elements must be free to be modified. A collection of element Ids
of all the affected elements is returned by this method.
The method is independent of the sequence's current starting number that might have
been assigned previously, meaning that the new number will be accepted even if it is
lower than the previously set start number in the sequence.
partition:
Name of the partition that identifies the sequence containing the number to be changed.
fromNumber:
Number to be changed; there must already be an element with that number in the sequence.
toNumber:
Number to change to; no element must have this number yet in the sequence.
Returns:
A collection of elements affected by the change of the number
Throws Autodesk.Revit.Exceptions.ArgumentException:
The sequence partition does not exist in the schema.
-or-
The specified sequence does not contain any elements with the given fromNumber.
-or-
There already are elements with the given toNumber in the specified sequence.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The value of toNumber must be in the range from 1 to the maximum value for an Integer type
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Either the schema or its document cannot be modified at present.
-or-
Can't access the number while an async operation is running.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.NumberingParameterId
Id of the parameter that stores values of the numbers on enumerated elements.
Remarks:
Values of numbers can be obtained by querying this parameter for the respective numbered element.
Note: The parameter can be changed directly, but if a value that already exists in the sequence is provided
a warning will be presented asking the user to select a proper course of action.
Programmatically with better control the value can be changed(with restrictions) using the Autodesk.Revit.DB.NumberingSchema.ChangeNumber(System.String,System.Int32,System.Int32) method.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.MatchGeometry
If true the matching for this numbering schema will consider the geometry of the input elements.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.Priority
The priority for this numbering schema.
Remarks:
If two numbering schemas have the same scope and the same output parameter only the one with the highest priority will be executed.
If two schemas have the same priority, the same scope and the same output parameter one of them will be selected as the executing schema.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.Enabled
True if the NumberingSchema is in use. False otherwise.
Since:
2015

Autodesk.Revit.DB.NumberingSchema.HasRoomRelatedParameters
Returns true if in the partitioning, matching or formatting there are parameters that require room associations.
Since:
2015

Autodesk.Revit.DB.NumberingSchema
A class to support assigning numbers to elements of a particular kind for the purpose of tagging and scheduling them.
Complete configuration settings for formatting.
Remarks:
Each NumberingSchema controls numbering of elements of one particular kind, typically of the same category such
as Rebar or Fabric Reinforcement. Instances of NumberingSchema are also elements and there is always only one of
each type in every Revit document. Available types of all built-in numbering schemas are enumerated in
Autodesk.Revit.DB.NumberingSchemaTypes class. At present, schema elements cannot be manually
added, deleted, or copied. Attempts to do so will result in a failure warning and/or exceptions thrown.
Elements (e.g. Rebar) belonging to a particular schema (e.g. NumberingSchemaTypes.StructuralNumberingSchemas.Rebar)
are organized and numbered in sequences. A sequence is a collection of elements that share the same numbering partition
as defined by their respective values of the Partition parameter (NUMBER_PARTITION_PARAM). For a numbering sequence
to exist it must contain at least one element. In other words, a sequence is established once there is at least
one element of which the partition parameter has a value that differs from other elements (in the same numbering schema).
If the last element is removed (deleted or moved to a different sequence) the then empty sequence ceases to exist.
Elements get assigned to sequences either upon their creation (based on the then current numbering partition value),
or by explicitly modifying the Partition parameter of an element, or by using the AssignElementsToSequence method.
It is highly recommended using that method over explicitly changing the Partition parameter, because the methods applies changes
to sequences and element numbers immediately, while changed parameters get into effect only after the current transaction is closed.
In addition to directly or indirectly changing the Partition parameter of elements, numbering sequences can be
reorganized by using methods of the NumberingSchema class. The MoveSequence method moves
all elements of an existing sequence to a new sequence that does not exist yet in the schema, thus effectively renaming
the Partition parameter on all the affected elements. The AppendSequence method removes
all elements from one sequence and appends them to elements of another existing sequence while applying the matching policy.
The method MergeSequences takes elements of all specified sequences and moves them all into a newly created sequence.
All the merged elements will be renumbered and matched as needed based on the matching algorithm.
Elements in different sequences are numbered independently, meaning that there may be elements with the same
number in two sequences even though the elements are different. Likewise, there may be perfectly identical
elements in two or more sequences bearing different numbers. However, within each one numbering sequence any
two identical elements will always have the same number, while different elements will never have the same
number within a numbering sequence. Revit refers to this rule as the matching policy.
Enumerable elements are always numbered automatically upon their creation. Each new element will get an
incrementally higher number. However, thanks to the matching policy, new elements that match existing elements
within the same sequence will get the same number assigned. Elements will keep their assigned numbers as long
as it is possible. This means, for example, that if some previously created elements (e.g. Rebar) get deleted,
all remaining elements (within the same numbering sequence) will keep their numbers, which may result in gaps in
the respective numbering sequence. Gaps can be removed by invoking RemoveGaps for sequences
in which gaps are not desired.
Numbers are stored as values of a numbering parameter on each numbered element. The Id of the parameter is obtained
by querying the Autodesk.Revit.DB.NumberingSchema.NumberingParameterId property. The value of the number can be obtained by querying the
parameter for the respective numbered element. The value is read-only and thus cannot be set; it is always computed based
on relations of elements across numbering partitions and the matching policy within the numbering sequence of each element.
Even though numbers are always assigned automatically to all elements of a schema, the method
ChangeNumber gives the programmer a way to explicitly overwrite a specific number as long
as the new number is unique in the numbering sequence. The caller specifies a number to be changed and a new value that is
to be applied, providing the value does not exist yet in the same numbering sequence. Although this operation may seem rather
limited, it provides the programmer with freedom to change practically any number even if it may be achieved in multiple steps.
Since:
2015